<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of VMPK</string>
    <key>Identifier</key>
    <string>com.github.neilmartin83-recipes.download.VMPK</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VMPK</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>SOURCEFORGE_FILE_PATTERN</key>
                <string>vmpk-\S*-mac-x64\.dmg</string>
                <key>SOURCEFORGE_PROJECT_NAME</key>
                <string>vmpk</string>
            </dict>
            <key>Processor</key>
            <string>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
    </array>
</dict>
</plist>
