Description: Jamf Test Recipe.
Identifier: com.github.neilmartin83.Jamf
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Word
  OBJECT_NAME: A Name
  OBJECT_TYPE: computer_extension_attribute_classic
  VALUE: Hello there!

Process:

- Processor: com.github.grahampugh.recipes.commonprocessors/IconGenerator
  Arguments:
    source_app: /Applications/Microsoft Word.app
    composite_install_path: "%RECIPE_CACHE_DIR%/%NAME%-install.png"
    composite_update_path: "%RECIPE_CACHE_DIR%/%NAME%-update.png"
    composite_uninstall_path: "%RECIPE_CACHE_DIR%/%NAME%-uninstall.png"
