Description: Jamf Test Recipe.
Identifier: com.github.neilmartin83.Jamf
MinimumVersion: 0.2.0

Input:
  VALUE: Test Value

Process:
- Processor: com.github.neilmartin83.SharedProcessors/AddXMLTagProcessor
  Arguments:
    input_path: "/Users/Shared/testfile.xml"
    parent_xpath: .//popup_choices/
    new_element: choice
    text: "%VALUE%"
