Description: Downloads the latest version of Labels and Addresses.
Identifier: com.github.neilmartin83.download.LabelsandAddresses
MinimumVersion: "2.3"

Input:
  NAME: LabelsandAddresses
  DOWNLOAD_URL: https://s3.amazonaws.com/belightsoft/LabelsAddresses.dmg

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Labels & Addresses.app'
    requirement: identifier "com.belightsoft.LabelsAddresses" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7TJZ7EZWM6"
