Description: Downloads the latest version of Labels & Addresses and creates a package.
Identifier: com.github.neilmartin83.pkg.LabelsandAddresses
ParentRecipe: com.github.neilmartin83.download.LabelsandAddresses
MinimumVersion: "2.3"

Input:
  NAME: LabelsandAddresses
  BUNDLE_ID: com.belightsoft.LabelsAddresses

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Labels & Addresses.app'
    source_path: '%pathname%/Labels & Addresses.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: '%BUNDLE_ID%'
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'
