Description: Downloads the latest version of Phocus and creates a package.
Identifier: com.github.neilmartin83.pkg.Phocus
ParentRecipe: com.github.neilmartin83.download.Phocus
MinimumVersion: "2.3"

Input:
  NAME: Phocus

Process:
- Processor: AppPkgCreator
