Description: Downloads the latest version of Phocus and imports into Munki
Identifier: com.github.neilmartin83.munki.Phocus
ParentRecipe: com.github.neilmartin83.download.Phocus
MinimumVersion: "2.3"

Input:
  NAME: Phocus
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Our powerful, free RAW file image processing software has been updated and expanded with new features that work seamlessly with all Hasselblad cameras.
    developer: Hasselblad
    display_name: Phocus
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
