Description: Downloads the latest version of DrawBot and creates a package.
Identifier: com.github.neilmartin83.pkg.DrawBot
ParentRecipe: com.github.neilmartin83.download.DrawBot
MinimumVersion: "2.3"

Input:
  NAME: DrawBot

Process:
- Processor: AppPkgCreator
