Description: Downloads the latest version of RecipeBuilder
Identifier: com.github.neilmartin83.download.RecipeBuilder
MinimumVersion: "2.3"

Input:
  NAME: RecipeBuilder
  GITHUB_REPO: mikaellofgren/RecipeBuilder

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: '%GITHUB_REPO%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/unpack/RecipeBuilder.app'
    requirement: anchor apple generic and identifier "se.mikaellofgren.RecipeBuilder" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = F489D96499)
