<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of RecipeBuilder and imports into Munki</string>
        <key>Identifier</key>
        <string>com.github.neilmartin83.munki.RecipeBuilder</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>NAME</key>
            <string>RecipeBuilder</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>GUI app for creating AutoPkg recipes.</string>
                <key>developer</key>
                <string>Mikael Lofgren</string>
                <key>display_name</key>
                <string>RecipeBuilder</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true></true>
                <key>unattended_uninstall</key>
                <true></true>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>ParentRecipe</key>
        <string>com.github.neilmartin83.download.RecipeBuilder</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%dmg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack</string>                   
					</array>
				</dict>
			</dict>
        </array>
    </dict>
</plist>