Description: Downloads the latest version of RecipeBuilder and imports into Munki
Identifier: com.github.neilmartin83.munki.RecipeBuilder
ParentRecipe: com.github.neilmartin83.download.RecipeBuilder
MinimumVersion: "2.3"

Input:
  NAME: RecipeBuilder
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: GUI app for creating AutoPkg recipes.
    developer: Mikael Lofgren
    display_name: RecipeBuilder
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true

Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/unpack'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
