Description: Downloads the latest version of RecipeBuilder and then uploads to the JSS
Identifier: com.github.neilmartin83.jss.RecipeBuilder
ParentRecipe: com.github.neilmartin83.pkg.RecipeBuilder
MinimumVersion: "2.3"

Input:
  NAME: RecipeBuilder
  CATEGORY: Applications
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: PolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: GUI app for creating AutoPkg recipes.
  SELF_SERVICE_ICON: RecipeBuilder.png

Process:
- Processor: DeprecationWarning
  Arguments:
    warning_message: JSSImporter, which this recipe requires, is no longer maintained. Consider switching to an equivalent JamfUploader recipe (https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors). This JSS recipe will be removed in the future.

- Processor: JSSImporter
  Arguments:
    category: '%CATEGORY%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%NAME%'
    self_service_description: '%SELF_SERVICE_DESCRIPTION%'
    self_service_icon: '%SELF_SERVICE_ICON%'
    version: '%version%'
