<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of VCV Rack and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.neilmartin83.pkg.VCVRack</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VCV_Rack</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.neilmartin83.download.VCVRack</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%destination_path%/Rack.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
		<dict>
            		<key>Processor</key>
            		<string>PathDeleter</string>
            		<key>Arguments</key>
            		<dict>
                	<key>path_list</key>
                	<array>
                    		<string>%destination_path%</string>
                	</array>
            	</dict>
        </dict>
	</array>
</dict>
</plist>
