<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Native Instruments Native Access and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.neilmartin83.pkg.NativeAccess</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.native-instruments.nativeaccess</string>
		<key>NAME</key>
		<string>Native_Instruments_Native_Access</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.neilmartin83.download.NativeAccess</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_%version%.pkg</string>
			</dict>

		</dict>
	</array>
</dict>
</plist>
