Description: Downloads the latest version of Native Instruments Native Access.
Identifier: com.github.neilmartin83.download.NativeAccess
MinimumVersion: 1.0.0

Input:
  NAME: Native_Instruments_Native_Access
  DOWNLOAD_URL: https://www.native-instruments.com/fileadmin/downloads/Native-Access_2_Mac_Intel.dmg

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Native Access.app'
    requirement: identifier "com.native-instruments.nativeaccess2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "83K5EG6Z9V"

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Native Access.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
