Description: Downloads the latest version of Astute Manager and creates a package.
Identifier: com.github.neilmartin83.pkg.Astute Manager
ParentRecipe: com.github.neilmartin83.download.Astute Manager
MinimumVersion: "2.3"

Input:
  NAME: AstuteManager

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Astute Manager.app'
    source_path: '%pathname%/Astute Manager.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: com.astutegraphics.astutemanager.pkg
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'
      scripts: package_scripts
