Description: Downloads Zotero disk image and builds a package.
Identifier: com.github.neilmartin83.pkg.Zotero
ParentRecipe: com.github.joshua-d-miller.download.zotero
MinimumVersion: "2.3"

Input:
  NAME: Roy_Rosenzweig_Zotero

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Zotero.app'
    source_path: '%pathname%/Zotero.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: org.zotero.pkg
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%_%version%'
