<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates an installer pkg for Finale with the Garritan Instruments (v.26 and later) that installs properly using a management system.
This recipe uses the PackageRequired option and assumes you are specifying the Disk Image that contains 
the Finale Installer(s). For example:

autopkg run Finale.pkg --pkg /path/to/Finale26.2.dmg

Inspired by Anthony Reimer's Finale recipes.
</string>
	<key>Identifier</key>
	<string>com.github.neilmartin83.pkg.Finale</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Finale</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: MakeMusic, Inc. (77WERABCRU)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%PKG%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%PKG%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Finale*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%found_filename%/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/Finale.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/FinaleSetup.dmg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%PKG%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;
&lt;plist version="1.0"&gt;
&lt;array&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;1&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;-1&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;1&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;false/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;0&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;0&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;0&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;0&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_2&lt;/string&gt;
    &lt;/dict&gt;
&lt;/array&gt;
&lt;/plist&gt;</string>
				<key>file_mode</key>
				<string>0744</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/silentInstallerChoices.plist</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/sh
# Installs Finale. Assumes installer is already available in the path specified by $install_dir.

# Determine working directory
install_dir=$(dirname $0)

/usr/bin/hdiutil attach "${install_dir}/FinaleSetup.dmg" -nobrowse
/usr/sbin/installer -pkg "/Volumes/Finale/Install Finale.pkg" -tgt / -applyChoiceChangesXML "${install_dir}/silentInstallerChoices.plist"
/usr/sbin/installer -pkg "/Volumes/Finale/External/Garritan_ARIA_Player.pkg" -tgt /
/usr/sbin/installer -pkg "/Volumes/Finale/External/Garritan_Instruments_for_Finale.pkg" -tgt /
/bin/sleep 10
/usr/bin/hdiutil detach "/Volumes/Finale"</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>id</key>
					<string>com.makemusic.finale.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
