<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Nucleo</string>
        <key>Identifier</key>
        <string>com.github.neilmartin83-recipes.download.Nucleo</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Nucleo</string>
            <key>DOWNLOAD_URL</key>
            <string>https://nucleoapp.com/download/mac/latest</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.zip</string>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/Applications</string>
                    <key>purge_destination</key>
                    <true></true>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/Applications/Nucleo.app</string>
                    <key>requirement</key>
                    <string>identifier "co.ambercreative.nucleo" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "62YXLY7NMM"</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>