Description: Downloads the latest version of Fanny
Identifier: com.github.neilmartin83.download.Fanny
MinimumVersion: 0.5.0

Input:
  NAME: Fanny
  DOWNLOAD_URL: https://fannywidget.com/FannyWidget.zip

Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unzip'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/unzip/*/Fanny.app'
    requirement: anchor apple generic and identifier "com.fannywidget" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = E5BK5K7RRN)
