Description: Downloads the latest version of Nessus Agent
Identifier: com.github.neilmartin83-recipes.download.Nessus Agent
MinimumVersion: "2.3"

Input:
  NAME: Nessus Agent

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '"id":(?P<id>\d*),"file":"NessusAgent-(?P<version>\d+\.\d+\.\d+)\.dmg"'
    url: https://www.tenable.com/downloads/nessus-agents?loginAttempted=true

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.dmg'
    url: https://www.tenable.com/downloads/api/v1/public/pages/nessus-agents/downloads/%id%/download?i_agree_to_tenable_license_agreement=true

- Processor: EndOfCheckPhase

- Processor: FileFinder
  Arguments:
    pattern: '%pathname%/*.pkg'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Tenable, Inc. (4B8J598M7U)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%/%dmg_found_filename%'
