Description: Downloads the latest version of LAPS for macOS and builds a package.
Identifier: com.github.neilmartin83.pkg.LAPSformacOS
ParentRecipe: com.github.neilmartin83.download.LAPSformacOS
MinimumVersion: 0.2.0

Input:
  NAME: LAPS-for-macOS

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Unarchiver
  Arguments:
    destination_path: '%pkgroot%/Applications'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: com.github.joshua-d-miller.LAPS-for-macOS
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'
