Description: Downloads the latest version of Buttplug intiface-desktop and creates a package.
Identifier: com.github.neilmartin83.pkg.intiface-desktop
ParentRecipe: com.github.neilmartin83.download.intiface-desktop
MinimumVersion: 1.0.0

Input:
  NAME: intiface-desktop

Process:
- Processor: AppPkgCreator
