Description: Downloads the latest version of Buttplug intiface-desktop.
Identifier: com.github.neilmartin83.download.intiface-desktop
MinimumVersion: 1.0.0

Input:
  NAME: intiface-desktop
  GITHUB_REPO: intiface/intiface-desktop

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: .*\.dmg$
    github_repo: '%GITHUB_REPO%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/intiface-desktop.app'
    requirement: identifier "com.nonpolynomiallabs.intiface-desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MSRA4LCTEZ

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/intiface-desktop.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
