Description: Downloads the latest version of intiface-desktop and imports it into Munki.
Identifier: com.github.neilmartin83.munki.intiface-desktop
ParentRecipe: com.github.neilmartin83.download.intiface-desktop
MinimumVersion: 1.0.0

Input:
  NAME: intiface-desktop
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Desktop GUI App for Intiface Service Usage
    developer: Nonpolynomial Labs, LLC
    display_name: intiface-desktop
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
