Description: |
  Downloads Firefox disk image and builds a package, copying your
  'distribution/policies.json' file into the application bundle. Adapted from 
  Greg Neagle's FirefoxAutoconfig.pkg recipe.
  
  Create a 'distribution' directory in the same directory as the recipe
  and copy your policies.json file there. Firefox versions below 60 are not 
  supported by this recipe. ORG_NAME is inserted into the pkg name to distinguish 
  a vanilla "Firefox-60.0.pkg" from "Firefox_PretendCo-60.0.pkg". You might 
  consider setting a unique PKG_ID to differentiate your org's "flavor" of Firefox.
  
  Values for RELEASE correspond to directories here: 
      http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
  Some useful values are: 
      'latest', 'latest-10.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
  LOCALE corresponds to directories at 
      http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$FIREFOX_BUILD/mac/
  Examples include 'en_GB', 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'
  
  No idea if all Firefox builds are available in all the same localizations, 
  so you may need to verify that any particular combination is offered."
Identifier: com.github.neilmartin83.pkg.FirefoxPolicies
ParentRecipe: com.github.autopkg.download.firefox-rc-en_US
MinimumVersion: 0.4.0

Input:
  NAME: Firefox
  LOCALE: en_GB
  ORG_NAME: Custom_Policy
  PKG_ID: org.mozilla.firefox.pkg
  RELEASE: latest-esr

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Firefox.app'
    source_path: '%pathname%/Firefox.app'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Firefox.app/Contents/Resources/distribution'
    source_path: '%RECIPE_DIR%/distribution'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: '%PKG_ID%'
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%_%ORG_NAME%-%version%'
