<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the Adobe Device License Expiry Check tool so it installs in /usr/local/bin</string>
    <key>Identifier</key>
    <string>com.github.neilmartin83.pkg.AdobeExpiryCheck</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeExpiryCheck</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.neilmartin83.download.AdobeExpiryCheck</string>
    <key>Process</key>
    <array>
       <dict>     
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr/local/bin</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
            	<key>destination_path</key>
            	<string>%RECIPE_CACHE_DIR%/unzip</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
            	<key>source_path</key>
            	<string>%RECIPE_CACHE_DIR%/unzip/AdobeExpiryCheck/AdobeExpiryCheck</string>
            	<key>destination_path</key>
            	<string>%pkgroot%/usr/local/bin</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/FileMode</string>
			<key>Arguments</key>
			<dict>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%pkgroot%/usr/local/bin/AdobeExpiryCheck</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
					<key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>com.adobe.AdobeExpiryCheck</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
