<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the Adobe Device License Expiry Check tool - https://helpx.adobe.com/enterprise/kb/volume-license-expiration-check.html</string>
	<key>Identifier</key>
	<string>com.github.neilmartin83.download.AdobeExpiryCheck</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeExpiryCheck</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://helpx.adobe.com/enterprise/kb/volume-license-expiration-check.html</string>
				<key>re_pattern</key>
				<string>(\/\S*mac.zip)</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://helpx.adobe.com/enterprise/kb/volume-license-expiration-check.html</string>
				<key>re_pattern</key>
				<string>&lt;em&gt;v(\S*)&lt;\/em&gt;</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>https://helpx.adobe.com%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
