<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the Unauthorised Versions Uninstaller tool - https://helpx.adobe.com/enterprise/kb/remove-unauthorized-versions.html</string>
	<key>Identifier</key>
	<string>com.github.neilmartin83.download.AdobeUninstallUnauthorizedVersions</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeUninstallUnauthorizedVersions</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>https://download.adobe.com/pub/adobe/creativecloud/UninstallUnauthorizedVersions_mac.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
