<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the Unauthorized Versions Uninstaller tool so it will install in /private/tmp and adds a postinstall script to run it</string>
    <key>Identifier</key>
    <string>com.github.neilmartin83.pkg.AdobeUninstallUnauthorizedVersions</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>UninstallUnauthorizedVersions_mac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.neilmartin83.download.AdobeUninstallUnauthorizedVersions</string>
    <key>Process</key>
    <array>
       <dict>     
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>private/tmp</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
            	<key>destination_path</key>
            	<string>%RECIPE_CACHE_DIR%/unzip</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
            	<key>source_path</key>
            	<string>%RECIPE_CACHE_DIR%/unzip/%NAME%/</string>
            	<key>destination_path</key>
            	<string>%pkgroot%/private/tmp</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
					<key>version</key>
                    <string>1.0</string>
                    <key>id</key>
                    <string>com.adobe.AdobeUninstallUnauthorizedVersions</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>private</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
					<key>scripts</key>
                    <string>AdobeUninstallUnauthorizedVersions_Scripts</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
