<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Sinter</string>
        <key>Identifier</key>
        <string>com.github.neilmartin83.download.Sinter</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Sinter</string>
            <key>INCLUDE_PRERELEASES</key>
            <string>True</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>github_repo</key>
                    <string>trailofbits/sinter</string>
                    <key>include_prereleases</key>
                    <string>%INCLUDE_PRERELEASES%</string>
                </dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%url%</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: TRAIL OF BITS INC (44WTB9L362)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>