Description: Downloads the latest version of Mounty and creates a package.
Identifier: com.github.neilmartin83.pkg.Mounty
ParentRecipe: com.github.andrewvalentine.download.Mounty
MinimumVersion: "2.3"

Input:
  NAME: Mounty

Process:
- Processor: AppPkgCreator
